#题目：输入某年某月某日，判断这一天是这一年的第几天？  
# .程序分析：以3月5日为例，应该先把前两个月的加起来，然后再加上5天即本年的第几天，
# 特殊情况，闰年且输入月份大于3时需考虑多加一天。  
p = [31,28,31,30,31,30,31,31,30,31,30,31] # 平年
w = [31,29,31,30,31,30,31,31,30,31,30,31] # 闰年

year =int(raw_input("请输入年："+'\n'))
month =int(raw_input("请输入月："+'\n'))
day=int(raw_input("请输入日："+'\n'))

arr=[31,28,31,30,31,30,31,31,30,31,30,31]
sum=day
for i in range(0,month-1):
    sum+=arr[i]
if year%4==0:
    if year%100==0 and year%400!=0:
        print("这是今年的第%d天" % sum)
    else:
        sum=sum+1
        print ("这是今年的第%d天" % sum)
else:
    print("这是今年的第%d天" % sum)